{
    "pt": {
        "nav": {
            "home": "Início",
            "about": "Sobre mim",
            "projects": "Projetos",
            "contact": "Contatos"
        },
        "home": {
            "welcome": "Bem-vindo(a), me chamo -",
            "paragraph": "Explorando o frontend e o backend com criatividade.",
            "question": "Vamos tirar ideias do papel?"
        },
        "about": {
            "title": "Sobre mim...",
            "description": "Sou João Vitor, desenvolvedor fullstack. Gosto de transformar ideias em soluções reais, criando aplicações completas, do frontend ao backend. Estou sempre buscando aprender e evoluir na área da tecnologia. 🚀"
        },
        "projects": {
            "title": "Projetos",
            "project": {
                "witw": {
                    "name": "Onde no mundo?",
                    "description": "O projeto Where in the world? é uma aplicação web dinâmica que apresenta dados completos sobre todos os países do mundo, com base na REST Countries API. Desenvolvido com foco em usabilidade e experiência visual, o sistema permite ao usuário explorar países por meio de uma busca inteligente, que pode ser combinada com filtros por continente. Ao clicar em um país, uma página dedicada exibe detalhes como bandeira, população, idioma, moeda, sub-região, domínio e países fronteiriços, permitindo também a navegação entre eles de forma fluida. A interface conta com suporte a tema escuro e animações que enriquecem a interação, mantendo o projeto leve e responsivo em diferentes dispositivos.",
                    "liveLink": "Veja o projeto"
                }
            }
        },
        "footer": {
            "name": "João Vitor",
            "form": {
                "title": "Entre em contato",
                "nameLabel": "Seu Nome:",
                "namePlaceholder": "Seu nome...",
                "emailLabel": "Seu Email:",
                "emailPlaceholder": "seuemail@email.com",
                "messageLabel": "Sua Mensagem:",
                "messagePlaceholder": "Sua mensagem..",
                "send": "Enviar"
            },
            "social": {
                "title": "Conecte-se"
            }
        }
    },
    "en": {
        "nav": {
            "home": "Home",
            "about": "About me",
            "projects": "Projects",
            "contact": "Contact"
        },
        "home": {
            "welcome": "Welcome, my name is -",
            "paragraph": "Exploring frontend and backend with creativity.",
            "question": "Shall we take ideas off the paper?"
        },
        "about": {
            "title": "About me",
            "description": "I'm João Vitor, a fullstack developer. I like to transform ideas into real solutions, creating complete applications, from frontend to backend. Always seeking to learn and evolve in the technology area. 🚀"
        },
        "projects": {
            "title": "Projects",
            "project": {
                "witw": {
                    "name": "Where in the World?",
                    "description": "The Where in the World? project is a dynamic web application that presents comprehensive data on all countries in the world, based on the REST Countries API. Developed with a focus on usability and visual experience, the system allows users to explore countries through an intelligent search, which can be combined with filters by continent. When clicking on a country, a dedicated page displays details such as flag, population, language, currency, subregion, domains, and neighboring countries, also allowing for fluid navigation between them. The interface supports a dark theme and animations that enhance interaction, keeping the project lightweight and responsive across devices.",
                    "liveLink": "View project"
                }
            }
        },
        "footer": {
            "name": "João Vitor",
            "form": {
                "title": "Get in touch",
                "nameLabel": "Your Name:",
                "namePlaceholder": "Your name...",
                "emailLabel": "Your Email:",
                "emailPlaceholder": "youremail@email.com",
                "messageLabel": "Your Message:",
                "messagePlaceholder": "Your message..",
                "send": "Send"
            },
            "social": {
                "title": "Connect with me"
            }
        }
    }
}